In [3]:
import pandas as pd

In [6]:
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}
datos

{'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
 'año': [2001, 2000, 2005, 2010],
 'rating': [7.2, 6.5, 8.1, 7.5]}

In [9]:
df = pd.DataFrame(datos)
df

       titulo   año  rating
0  Pelicula A  2001     7.2
1  Pelicula B  2000     6.5
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5

In [13]:
df_ordenado = df.sort_values(by='año', ascending=False)
df_ordenado

       titulo   año  rating
3  Pelicula D  2010     7.5
2  Pelicula C  2005     8.1
0  Pelicula A  2001     7.2
1  Pelicula B  2000     6.5

In [15]:
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}
df = pd.DataFrame(datos)

In [17]:
df_ordenado = df.sort_values(by='rating', ascending=False)
df_ordenado

       titulo   año  rating
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5
0  Pelicula A  2001     7.2
1  Pelicula B  2000     6.5

In [19]:
df_ordenado = df.sort_values(by='año')
df_ordenado

       titulo   año  rating
1  Pelicula B  2000     6.5
0  Pelicula A  2001     7.2
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5

In [23]:
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D', 'Pelicula E'],
    'género': ['Acción', 'Drama', 'Acción', 'Comedia', 'Drama'],
    'rating': [7.2, 8.5, 9.1, 6.5, 7.8]
}

In [25]:
df = pd.DataFrame(datos)
df

       titulo   género  rating
0  Pelicula A   Acción     7.2
1  Pelicula B    Drama     8.5
2  Pelicula C   Acción     9.1
3  Pelicula D  Comedia     6.5
4  Pelicula E    Drama     7.8

In [31]:
promedio_rating_por_genero = df.groupby(by='género')['rating'].mean()
promedio_rating_por_genero

género
Acción     8.15
Comedia    6.50
Drama      8.15
Name: rating, dtype: float64